In [283]:
import pandas as pd
from datetime import datetime
import re
import numpy as np

In [79]:
data = pd.read_csv('AccidentesAviones.csv')

In [199]:
data.head()

,Unnamed: 0,fecha,Hora,Ruta,OperadOR,flight_no,route,Tipo_aeronave,registration,cn_ln,all_aboard,PASAJEROS A BORDO,crew_aboard,cantidad de fallecidos,passenger_fatalities,crew_fatalities,ground,summary,Hora_Minutos,FranjaHoraria
0,0,"September 17, 1908",1718,"Fort Myer, Virginia",Military - U.S. Army,?,Demonstration,Wright Flyer III,?,1,2,1,1,1,1,0,0,"During a demonstration flight, a U.S. Army fly...",17:18,17
1,1,"September 07, 1909",?,"Juvisy-sur-Orge, France",?,?,Air show,Wright Byplane,SC1,?,1,0,1,1,0,0,0,Eugene Lefebvre was the first pilot to ever be...,None,None
2,2,"July 12, 1912",0630,"Atlantic City, New Jersey",Military - U.S. Navy,?,Test flight,Dirigible,?,?,5,0,5,5,0,5,0,First U.S. dirigible Akron exploded just offsh...,06:30,06
3,3,"August 06, 1913",?,"Victoria, British Columbia, Canada",Private,?,?,Curtiss seaplane,?,?,1,0,1,1,0,1,0,The first fatal airplane accident in Canada oc...,None,None
4,4,"September 09, 1913",1830,Over the North Sea,Military - German Navy,?,?,Zeppelin L-1 (airship),?,?,20,?,?,14,?,?,0,The airship flew into a thunderstorm and encou...,18:30,18

In [200]:
data.rename(columns={'Unnamed: 0': 'No.'}, inplace=True)

In [234]:
#Obtenemos informacion de la data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5008 entries, 0 to 5007
Data columns (total 21 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   No.                     5008 non-null   int64
 1   fecha                   5008 non-null   datetime64[ns]
 2   Hora                    5008 non-null   object
 3   Ruta                    5008 non-null   object
 4   OperadOR                5008 non-null   object
 5   flight_no               5008 non-null   object
 6   route                   5007 non-null   object
 7   Tipo_aeronave           5008 non-null   object
 8   registration            5008 non-null   object
 9   cn_ln                   5008 non-null   object
 10  all_aboard              5008 non-null   object
 11  PASAJEROS A BORDO       5008 non-null   object
 12  crew_aboard             5008 non-null   object
 13  cantidad de fallecidos  5008 non-null   object
 14  passenger_fatalities    5008 non-null   object
 15  crew_fatalities         5008 non-null   object
 16  ground                  5008 non-null   object
 17  summary                 5008 non-null   object
 18  Hora_Minutos            3501 non-null   object
 19  FranjaHoraria           3501 non-null   object
 20  año                     5008 non-null   int32
dtypes: datetime64[ns](1), int32(1), int64(1), object(18)
memory usage: 802.2+ KB

In [5]:
data.isnull().sum()

Unnamed: 0                0
fecha                     0
HORA declarada            0
Ruta                      0
OperadOR                  0
flight_no                 0
route                     1
ac_type                   0
registration              0
cn_ln                     0
all_aboard                0
PASAJEROS A BORDO         0
crew_aboard               0
cantidad de fallecidos    0
passenger_fatalities      0
crew_fatalities           0
ground                    0
summary                   0
dtype: int64

In [229]:
data[data=='?'].count()

No.                          0
fecha                        0
Hora                      1504
Ruta                         5
OperadOR                    10
flight_no                 3682
route                      762
Tipo_aeronave               13
registration               272
cn_ln                      667
all_aboard                  17
PASAJEROS A BORDO          221
crew_aboard                219
cantidad de fallecidos       8
passenger_fatalities       235
crew_fatalities            235
ground                      44
summary                     59
Hora_Minutos                 0
FranjaHoraria                0
dtype: int64

In [231]:
data['fecha'] = pd.to_datetime(data['fecha'], format='%B %d, %Y')

In [233]:
data['año'] = data['fecha'].dt.year

In [9]:
data['año'].describe()

count    5008.000000
mean     1970.851637
std        24.703696
min      1908.000000
25%      1951.000000
50%      1970.000000
75%      1992.000000
max      2021.000000
Name: año, dtype: float64

In [247]:
Año = data[['No.','año']].copy()

In [248]:
Año.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5008 entries, 0 to 5007
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   No.     5008 non-null   int64
 1   año     5008 non-null   int32
dtypes: int32(1), int64(1)
memory usage: 58.8 KB

In [249]:
Año.to_csv('Año.csv')

In [72]:
# Revisamos la columna HORA declarada
data['HORA declarada']

0        1718
1           ?
2        0630
3           ?
4        1830
        ...
5003     1835
5004     1800
5005     0800
5006    11:30
5007     1500
Name: HORA declarada, Length: 5008, dtype: object

In [74]:
data['HORA declarada'].head()

0    1718
1       ?
2    0630
3       ?
4    1830
Name: HORA declarada, dtype: object

In [80]:
# Renombramos la columna a 'Hora'
data.rename(columns={'HORA declarada': 'Hora'}, inplace=True)
data['Hora']

0        1718
1           ?
2        0630
3           ?
4        1830
        ...
5003     1835
5004     1800
5005     0800
5006    11:30
5007     1500
Name: Hora, Length: 5008, dtype: object

In [93]:
# Se buscan letras en la columna 
data[data['Hora'].str.contains('[a-zA-Z]')].head()

,Unnamed: 0,fecha,Hora,Ruta,OperadOR,flight_no,route,ac_type,registration,cn_ln,all_aboard,PASAJEROS A BORDO,crew_aboard,cantidad de fallecidos,passenger_fatalities,crew_fatalities,ground,summary
84,84,"September 14, 1923",c 18:00,"Near Ivinghoe, Buckinghamshire, England",Daimler Airways,?,Croydon - Manchester,de Havilland DH-34,G-EBBS,29,5,3,2,5,3,2,0,Crashed while attempting a forced landing afte...
87,87,"December 23, 1923",c 02:30,Over the Mediterranean Sea,Military - French Navy,?,Toulon - Algiers,Zeppelin Dixmunde (airship),L-72,?,52,?,?,52,?,?,0,"Crashed while on a flight from Toulon, France ..."
95,95,"December 24, 1924",c 12:00,"Purley, England",Imperial Airways,?,London - Paris,de Havilland DH-34B,G-EBBX,36,8,7,1,8,7,1,0,"Shortly after taking off, witnesses observed a..."
117,117,"October 21, 1926",c 13:15,English Channel,Imperial Airways,?,Croydon - Paris,Handley Page W-10,G-EBMS,W10/3,12,10,2,0,0,0,0,The plane was on a flight from London to Paris...
157,157,"August 25, 1928",c 11:00,"Near Port Townsend, BC, Canada",British Columbia Airways,?,Victoria - Seattle,Ford 4-AT-B Tri Motor,G-CATX,4-AT-26,7,5,2,7,5,2,0,Crashed into Puget Sound in dense fog 12 miles...

In [91]:
# Se identificaron registros incorrectos para no perderlos se remplazamos esas letras por vacio
data['Hora'] = data['Hora'].str.replace(r'^c:?', '')

In [95]:
# Se crea una funcion para extraer solos valores con el formato requerido del campo 'Hora'
def extraer_hora_minutos(texto):
    # Utiliza una expresión regular para buscar un patrón de hora y minutos
    patron = r'(\d{1,2})[ :]?(\d{2})'
    coincidencia = re.search(patron, str(texto))
    if coincidencia:
        hora = coincidencia.group(1)
        minutos = coincidencia.group(2)
        return f'{hora.zfill(2)}:{minutos.zfill(2)}'
    return None

# Aplica la función para extraer la hora y los minutos a la columna 'Hora'
data['Hora_Minutos'] = data['Hora'].apply(lambda x: extraer_hora_minutos(x))

In [104]:
data['FranjaHoraria'] = data['Hora_Minutos'].str.split(':').str[0]

In [201]:
# Se crea esta datraframe, para luego borrar nulos y evaluar las horas en base a la informacion disponible
Hora = data[['No.','Hora_Minutos','FranjaHoraria']].copy()
Hora

       No. Hora_Minutos FranjaHoraria
0        0        17:18            17
1        1         None          None
2        2        06:30            06
3        3         None          None
4        4        18:30            18
...    ...          ...           ...
5003  5003        18:35            18
5004  5004        18:00            18
5005  5005        08:00            08
5006  5006        11:30            11
5007  5007        15:00            15

[5008 rows x 3 columns]

In [202]:
# Se borran los nulos
Hora= Hora.dropna()

In [203]:
Hora.shape

(3501, 3)

In [250]:
Hora.to_csv('Hora.csv')

In [312]:
# Observamos la columna 'Ruta'
Ruta=data[['No.','Ruta']].copy()

In [313]:
#Operador =Operador[Operador['OperadOR'] != '?']
Ruta = Ruta[Ruta['Ruta'] != '?']
Ruta.shape

(5003, 2)

In [315]:
Ruta.to_csv('Ruta.csv')

:

In [207]:
# Observamos la columna 'OperadOR' 
Operador = data[['No.','OperadOR']].copy()
print(Operador.head())
print(Operador.shape)

   No.                OperadOR
0    0    Military - U.S. Army
1    1                       ?
2    2    Military - U.S. Navy
3    3                 Private
4    4  Military - German Navy
(5008, 2)

In [208]:
#Obtenemos los datos disponibles
Operador =Operador[Operador['OperadOR'] != '?']
Operador.shape

(4998, 2)

In [252]:
Operador.to_csv('Operador.csv')

In [141]:
data.rename(columns={'ac_type': 'Tipo_aeronave'}, inplace=True)

In [209]:
aeronave = data[['No.','Tipo_aeronave']].copy()

In [210]:
aeronave = aeronave[aeronave['Tipo_aeronave'] != '?']
print(aeronave.head())
print(aeronave.shape)

   No.           Tipo_aeronave
0    0        Wright Flyer III
1    1          Wright Byplane
2    2               Dirigible
3    3        Curtiss seaplane
4    4  Zeppelin L-1 (airship)
(4995, 2)

In [254]:
data[['No.','all_aboard','PASAJEROS A BORDO','crew_aboard','cantidad de fallecidos','passenger_fatalities','crew_fatalities']].head()

,No.,all_aboard,PASAJEROS A BORDO,crew_aboard,cantidad de fallecidos,passenger_fatalities,crew_fatalities
0,0,2,1,1,1,1,0
1,1,1,0,1,1,0,0
2,2,5,0,5,5,0,5
3,3,1,0,1,1,0,1
4,4,20,?,?,14,?,?

In [211]:
Tripulacion = data[['No.','all_aboard','cantidad de fallecidos',]].copy()

In [245]:
Tripulacion=Tripulacion[Tripulacion['all_aboard'] != '?']
Tripulacion.info() 
Tripulacion.shape

<class 'pandas.core.frame.DataFrame'>
Index: 4991 entries, 0 to 5007
Data columns (total 3 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   No.                     4991 non-null   int64
 1   all_aboard              4991 non-null   int32
 2   cantidad de fallecidos  4991 non-null   int32
dtypes: int32(2), int64(1)
memory usage: 117.0 KB

(4991, 3)

In [213]:
# Convertir las columnas a tipos de datos numéricos (enteros)
Tripulacion['all_aboard'] = Tripulacion['all_aboard'].astype(int)
Tripulacion['cantidad de fallecidos'] = Tripulacion['cantidad de fallecidos'].astype(int)

In [246]:
Tripulacion.to_csv('Tripulacion.csv')

In [277]:
detalle_Trip = data[['No.','all_aboard','PASAJEROS A BORDO','crew_aboard','cantidad de fallecidos','passenger_fatalities','crew_fatalities']].copy()

In [278]:
detalle_Trip = detalle_Trip[detalle_Trip.ne('?').all(1)]

In [285]:
detalle_Trip.rename(columns={'all_aboard':'Trip_abord','PASAJEROS A BORDO':'Pasajeros','crew_aboard':'Personal','cantidad de fallecidos':'Total_Falle','passenger_fatalities':'Pasajeros_falle','crew_fatalities':'Personal_falle'}, inplace=True)

In [286]:
detalle_Trip.info() 
detalle_Trip.shape

<class 'pandas.core.frame.DataFrame'>
Index: 4765 entries, 0 to 5007
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   No.              4765 non-null   int64
 1   Trip_abord       4765 non-null   int32
 2   Pasajeros        4765 non-null   int32
 3   Personal         4765 non-null   int32
 4   Total_Falle      4765 non-null   int32
 5   Pasajeros_falle  4765 non-null   int32
 6   Personal_falle   4765 non-null   int32
dtypes: int32(6), int64(1)
memory usage: 186.1 KB

(4765, 7)

In [281]:
detalle_Trip['all_aboard'] = detalle_Trip['all_aboard'].astype(int)
detalle_Trip['PASAJEROS A BORDO'] = detalle_Trip['PASAJEROS A BORDO'].astype(int)
detalle_Trip['crew_aboard'] = detalle_Trip['crew_aboard'].astype(int)
detalle_Trip['cantidad de fallecidos'] = detalle_Trip['cantidad de fallecidos'].astype(int)
detalle_Trip['passenger_fatalities'] = detalle_Trip['passenger_fatalities'].astype(int)
detalle_Trip['crew_fatalities'] = detalle_Trip['crew_fatalities'].astype(int)

In [290]:
detalle_Trip.head()

,No.,Trip_abord,Pasajeros,Personal,Total_Falle,Pasajeros_falle,Personal_falle
0,0,2,1,1,1,1,0
1,1,1,0,1,1,0,0
2,2,5,0,5,5,0,5
3,3,1,0,1,1,0,1
6,6,41,0,41,17,0,17

In [292]:
detalle_Trip.to_csv('Tripulaciondetallada.csv')

In [216]:
# Estdiamos el campo 'ground', por lo que creamos otro dataframe
Muerte_tierra = data[['No.','ground']].copy()
Muerte_tierra = Muerte_tierra[Muerte_tierra['ground'] != '?']
Muerte_tierra = Muerte_tierra.astype(int)

In [293]:
Muerte_tierra.to_csv('Muerte_tierra.csv')

In [226]:
data['summary'][0]

'During a demonstration flight, a U.S. Army flyer flown by Orville Wright nose-dived into the ground from a height of approximately 75 feet, killing Lt. Thomas E. Selfridge, 26, who was a passenger. This was the first recorded airplane fatality in history.  One of two propellers separated in flight, tearing loose the wires bracing the rudder and causing the loss of control of the aircraft.  Orville Wright suffered broken ribs, pelvis and a leg.  Selfridge suffered a crushed skull and died a short time later.'

In [237]:
descripcion = data[['No.','summary','año']].copy()
descripcion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5008 entries, 0 to 5007
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   No.      5008 non-null   int64
 1   summary  5008 non-null   object
 2   año      5008 non-null   int32
dtypes: int32(1), int64(1), object(1)
memory usage: 97.9+ KB

In [295]:
descripcion.to_csv('descripcion.csv')